# USER TEXT
START_MENU_TEXT = (
    "Саламчик! Это - лучший инструмент для крипты 💰\n\nВыбери категорию действий:"
)
BALANCE_MENU_TEXT = "Выберите сеть, в которой хотите проверить баланс 💸"
BAlANCE_SOLANA_TEXT = "Чекер баланса кошельков Solana🟣\n\nВведите кошельки построчно, как на примере:\n\n3bN7qzrzenrzyV8B6fTaYGfTo3cxPrpkis234dN6r8cf\nEVrUyF9cLtTfrvMWbKz98h15uEsPaKzvdYE6pLnrhSZi"
CHOSE_CHAIN_TEXT = "Чтобы создать/пересоздать ферму, сначала выберите блокченй 🟣🔵🟢"
CREATE_FARM_TEXT = "Отлично! Теперь пришли список кошельков в выбраном блокчейне построчно, как на примере:\n\n3bN7qzrzenrzyV8B6fTaYGfTo3cxPrpkis234dN6r8cf\nEVrUyF9cLtTfrvMWbKz98h15uEsPaKzvdYE6pLnrhSZi"
FARM_MENU_TEXT = "Хотите посмотреть анализ своей фермы? Или думаете что то изменить в ней? Выбирайте 👇"
EDIT_FARM_TEXT = "Вы хотите просто добавить кошельки или пересоздать всю ферму? 🧐"

# USER KEYBOARD
BALANCE_MENU_BUTTON = "Проверить баланс кошельков 👛"
DROP_MENU_BUTTON = "Проверить дропы проектов 🎈"
BALANCE_SOLANA_BUTTON = "Проверить баланс Solana кошельков 🟣"
BALANCE_EVM_BUTTON = "Проверить баланс EVM кошельков 🔵"
BALANCE_ABSTRACT_BUTTON = "Проверить баланс Abstract кошельков 🟢"
FARM_BUTTON = "Ферма 🚜"
FARM_SOLANA_BUTTON = "🟣 Solana"
FARM_EVM_BUTTON = "🔵 EVM"
FARM_ABSTRACT_BUTTON = "🟢 Abstract"
ANALYSIS_FARM_BUTTON = "Общий анализ фермы 🔬"
EDIT_FARM_BUTTON = "Изменить ферму 🛠"
EXPAND_FARM_BUTTON = "Расширить ферму ➕"
RECREATE_FARM_BUTTON = "Пересоздать ферму 🔄"

# ERROR TEXT
UNKNOWN_MESSAGE = "Не понимаю о чем ты 💀️"
ERROR = "Ошибка, попробуйте позже ⛔️"

# OTHER
BACK_BUTTON = "Назад 🔙"
SOON = "Soon... ⏳"
